many_cats/app/controllers/cats_controller.rb

  def update
    cat = Cat.find(params[:id])
    if cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "name" = $1, "color" = $2, "description" = $3, "updated_at" = $4 WHERE "cats"."id" = $5  [["name", "John"], ["color", "grey"], ["description", " Korean cat "], ["updated_at", "2018-11-13 22:47:01.701139"], ["id", 1]]